import type { Metadata } from 'next'

export const metadata: Metadata = {
  title: 'שלג-רוז - אוכל מוכן במשלוח',
  description: 'שלב – אוכל מוכן באהבה 🥂 הכי טעים, הכי טרי, הכי נוח! מגוון ענק של מנות חמוץ, תבשילים, סלטים ותוספות – פשוט לבחור וליהנות ✨ טעמים של בית בלי להיכנס למטבח! 🕗 ניתן להזמין עד יום חמישי בשעה 20:00 📦 הזמנות מיועדות ליום שישי בלבד 💳 ניתן לשלם באמצעות Bit, פייבוקס או מזומן כשר ✔️ בהשגחת הרבנות',
  metadataBase: new URL('https://food-one-cyan.vercel.app'),
  openGraph: {
    title: 'שלג-רוז - אוכל מוכן במשלוח',
    description: 'שלב – אוכל מוכן באהבה 🥂 הכי טעים, הכי טרי, הכי נוח! מגוון ענק של מנות חמוץ, תבשילים, סלטים ותוספות – פשוט לבחור וליהנות ✨ טעמים של בית בלי להיכנס למטבח! 🕗 ניתן להזמין עד יום חמישי בשעה 20:00 📦 הזמנות מיועדות ליום שישי בלבד 💳 ניתן לשלם באמצעות Bit, פייבוקס או מזומן כשר ✔️ בהשגחת הרבנות',
    type: 'website',
    url: 'https://food-one-cyan.vercel.app',
    siteName: 'שלג-רוז',
    images: [
      {
        url: 'https://food-one-cyan.vercel.app/hero-image.jpeg',
        width: 1200,
        height: 630,
        alt: 'שלג-רוז - אוכל מוכן במשלוח',
      },
    ],
  },
  twitter: {
    card: 'summary_large_image',
    title: 'שלג-רוז - אוכל מוכן במשלוח',
    description: 'שלב – אוכל מוכן באהבה 🥂 הכי טעים, הכי טרי, הכי נוח! מגוון ענק של מנות חמוץ, תבשילים, סלטים ותוספות – פשוט לבחור וליהנות ✨ טעמים של בית בלי להיכנס למטבח! 🕗 ניתן להזמין עד יום חמישי בשעה 20:00 📦 הזמנות מיועדות ליום שישי בלבד 💳 ניתן לשלם באמצעות Bit, פייבוקס או מזומן כשר ✔️ בהשגחת הרבנות',
    images: ['https://food-one-cyan.vercel.app/hero-image.jpeg'],
  },
} 